app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("address", "entity_type", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", ""], ["entity_type", ""], ["name", ""], ["created_at", "2015-10-04 19:10:30.086943"], ["updated_at", "2015-10-04 19:10:30.086943"]]
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save