app/controllers/zones_controller.rb

SELECT "zones".* FROM "zones"
---
  def index
    @zones = Zone.all

INSERT INTO "zones" ("name", "description", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Bacon Pancakes"], ["description", "Brenda's Fav Food"], ["city", "San Jose"], ["created_at", "2015-10-04 16:28:43.564318"], ["updated_at", "2015-10-04 16:28:43.564318"]]
---
  def create
    @zone = Zone.new(zone_params)

    respond_to do |format|
      if @zone.save

SELECT  "zones".* FROM "zones" WHERE "zones"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_zone
      @zone = Zone.find(params[:id])